# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# These are the common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all these commands by-heart!). If you are using my `${HOME}/.aliases`, they will already be present for you. If not, you can then set these up in the respective dotfile of your choice
# alias bcg='brew outdated --greedy'  # List all casks that are outdated like a "dry-run" (and which have version marked as 'latest')
# alias bcug='brew upgrade --greedy'  # Upgrades all casks that are outdated (and which have version marked as 'latest')
# alias bupc='brew bundle check || brew bundle --all --cleanup; brew bundle cleanup -f; brew cleanup --prune=all; brew autoremove; brew upgrade'        # Upgrades and cleans up all regular outdated casks and libs (non-greedy)

# TODO: Need to find cask for:
#   Tinkertool
#   ZoomHider

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', no_quarantine: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = Hardware::CPU.arm?

tap 'homebrew/services'
tap 'romkatv/powerlevel10k'

brew 'autojump'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'btop'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'eza'
brew 'git-extras'
brew 'git-gui'
brew 'git-tools'
brew 'git'
brew 'jq'
brew 'less'
brew 'mise'
brew 'mkcert'
brew 'ncdu'
brew 'node'
brew 'nvm'
brew 'powerlevel10k'
brew 'prettyping'
brew 'ripgrep'
brew 'tldr'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wifi-password'
brew 'zsh'

# ----------------------------------------------------------------------------------------------------------
brew 'mas'
mas 'iBar-Menubar icon control tool', id: 6443843900
# ----------------------------------------------------------------------------------------------------------

cask 'aldente'
cask 'appcleaner'
cask 'arc'
cask 'clocker'
cask 'cloudflare-warp'
cask 'dbeaver-community'
cask 'font-meslo-lg-nerd-font'
cask 'iterm2'
cask 'itsycal'
cask 'keepassxc@beta'
cask 'keepingyouawake'
cask 'keybase'
cask 'middleclick'
cask 'monolingual'
cask 'notunes'
cask 'ollama', restart_service: :changed
cask 'protonvpn'
cask 'rancher'
cask 'raycast'
cask 'slack'
cask 'stats'
cask 'the-unarchiver'
cask 'vlc'
cask 'vscode'
cask 'zoom'

# VSCode extensions
# Note: I don't want brew to silently install VS Code (which is what it does currently if the following lines are present but it doesn't find code!)
is_vscode_installed = !`which code`.chomp.empty?
if is_vscode_installed
    vscode 'bradlc.vscode-tailwindcss'
    vscode 'britesnow.vscode-toggle-quotes'
    vscode 'dbaeumer.vscode-eslint'
    vscode 'eamodio.gitlens'
    vscode 'editorconfig.editorconfig'
    vscode 'esbenp.prettier-vscode'
    vscode 'firsttris.vscode-jest-runner'
    vscode 'github.copilot-chat'
    vscode 'github.copilot'
    vscode 'github.vscode-pull-request-github'
    vscode 'googlecloudtools.cloudcode'
    vscode 'k--kato.intellij-idea-keybindings'
    vscode 'mechatroner.rainbow-csv'
    vscode 'mkhl.direnv'
    vscode 'ms-vsliveshare.vsliveshare'
    vscode 'naumovs.color-highlight'
    vscode 'nextchaptersoftware.unblocked-vscode'
    vscode 'oderwat.indent-rainbow'
    vscode 'redhat.vscode-xml'
    vscode 'tyriar.sort-lines'
    vscode 'vscode-icons-team.vscode-icons'
    vscode 'wakatime.vscode-wakatime'
    vscode 'wayou.vscode-todo-highlight'
    vscode 'wmaurer.change-case'
    vscode 'yzhang.markdown-all-in-one'
end

# ----------------------------------------------------------------------------------------------------------
# TODO: This doesn't solve the issue about performing a custom action when a specific formula/cask is (re)installed - keeping for future reference
at_exit do
    # This is required for completions from other plugins to work (for eg git-extras)
    system("rm -rfv \"$HOMEBREW_REPOSITORY/share/zsh/site-functions/_git\"") || true
end
